#### Terraform Plan (staging) 📖`success`

<details><summary>Show Plan (staging)</summary>

```

terraform
[0m[1mdata.terraform_remote_state.foundation: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=677282655012][0m
[0m[1mdata.terraform_remote_state.foundation: Read complete after 0s[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_addon_version.aws_ebs_csi_driver[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "aws_ebs_csi_driver" {
      [32m+[0m[0m addon_name         = "aws-ebs-csi-driver"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.coredns[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "coredns" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.kube_proxy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "kube_proxy" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.vpc_cni[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "vpc_cni" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.28"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.tls_certificate.eks[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "tls_certificate" "eks" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = (known after apply)
    }

[1m  # aws_cloudwatch_log_group.eks_cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "eks_cluster" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/eks/astro-data-pipeline-staging-eks/cluster"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 7
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-eks-cluster-logs"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-eks-cluster-logs"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_eks_addon.aws_ebs_csi_driver[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "aws_ebs_csi_driver" {
      [32m+[0m[0m addon_name                  = "aws-ebs-csi-driver"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "astro-data-pipeline-staging-eks"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m service_account_role_arn    = (known after apply)
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_eks_addon.coredns[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "coredns" {
      [32m+[0m[0m addon_name                  = "coredns"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "astro-data-pipeline-staging-eks"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_eks_addon.kube_proxy[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "kube_proxy" {
      [32m+[0m[0m addon_name                  = "kube-proxy"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "astro-data-pipeline-staging-eks"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_eks_addon.vpc_cni[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "vpc_cni" {
      [32m+[0m[0m addon_name                  = "vpc-cni"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "astro-data-pipeline-staging-eks"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_eks_cluster.main[0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "main" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types     = [
          [32m+[0m[0m "api",
          [32m+[0m[0m "audit",
          [32m+[0m[0m "authenticator",
          [32m+[0m[0m "controllerManager",
          [32m+[0m[0m "scheduler",
        ]
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "astro-data-pipeline-staging-eks"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = (known after apply)
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-eks-cluster"
        }
      [32m+[0m[0m tags_all                      = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-eks-cluster"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m version                       = "1.28"

      [32m+[0m[0m access_config (known after apply)

      [32m+[0m[0m kubernetes_network_config (known after apply)

      [32m+[0m[0m upgrade_policy (known after apply)

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = true
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = [
              [32m+[0m[0m "173.64.75.241/32",
            ]
          [32m+[0m[0m security_group_ids        = [
              [32m+[0m[0m "sg-04c4b50cc24994ffe",
            ]
          [32m+[0m[0m subnet_ids                = [
              [32m+[0m[0m "subnet-08b9f319137d19eee",
              [32m+[0m[0m "subnet-08ea1e7229894d22f",
            ]
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # aws_eks_node_group.main["general"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "main" {
      [32m+[0m[0m ami_type               = "AL2_x86_64"
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = "ON_DEMAND"
      [32m+[0m[0m cluster_name           = "astro-data-pipeline-staging-eks"
      [32m+[0m[0m disk_size              = 20
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "t3.medium",
        ]
      [32m+[0m[0m labels                 = {
          [32m+[0m[0m "node.kubernetes.io/workload" = "general"
        }
      [32m+[0m[0m node_group_name        = "astro-data-pipeline-staging-general"
      [32m+[0m[0m node_group_name_prefix = (known after apply)
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = [
          [32m+[0m[0m "subnet-08ea1e7229894d22f",
        ]
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "staging"
          [32m+[0m[0m "Name"        = "astro-data-pipeline-staging-general-node-group"
          [32m+[0m[0m "NodeGroup"   = "general"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-general-node-group"
          [32m+[0m[0m "NodeGroup"          = "general"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m version                = (known after apply)

      [32m+[0m[0m node_repair_config (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 1
          [32m+[0m[0m max_size     = 3
          [32m+[0m[0m min_size     = 1
        }

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable_percentage = 25
        }
    }

[1m  # aws_iam_openid_connect_provider.eks[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_openid_connect_provider" "eks" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m client_id_list  = [
          [32m+[0m[0m "sts.amazonaws.com",
        ]
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-eks-oidc"
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-eks-oidc"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m thumbprint_list = (known after apply)
      [32m+[0m[0m url             = (known after apply)
    }

[1m  # aws_iam_policy.eks_s3_access[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "eks_s3_access" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "IAM policy for EKS nodes to access S3 buckets"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "astro-data-pipeline-staging-eks-s3-access"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "s3:GetObject",
                          [32m+[0m[0m "s3:PutObject",
                          [32m+[0m[0m "s3:DeleteObject",
                          [32m+[0m[0m "s3:ListBucket",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = [
                          [32m+[0m[0m "arn:aws:s3:::astro-data-pipeline-staging-*",
                          [32m+[0m[0m "arn:aws:s3:::astro-data-pipeline-staging-*/*",
                        ]
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
    }

[1m  # aws_iam_role.ebs_csi_driver[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "ebs_csi_driver" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = (known after apply)
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "astro-data-pipeline-ebs-csi-driver-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role.eks_cluster[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "eks_cluster" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "astro-data-pipeline-staging-eks-cluster-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-eks-cluster-role"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-eks-cluster-role"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role.eks_nodes[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "eks_nodes" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "astro-data-pipeline-staging-eks-nodes-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Name" = "astro-data-pipeline-staging-eks-nodes-role"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Environment"        = "staging"
          [32m+[0m[0m "Layer"              = "04-compute"
          [32m+[0m[0m "ManagedBy"          = "terraform"
          [32m+[0m[0m "Name"               = "astro-data-pipeline-staging-eks-nodes-role"
          [32m+[0m[0m "Owner"              = "pmcgee"
          [32m+[0m[0m "Project"            = "astro-data-pipeline"
          [32m+[0m[0m "TerraformWorkspace" = "staging"
          [32m+[0m[0m "Version"            = "0.1"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.ebs_csi_driver[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "ebs_csi_driver" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/Amazon_EBS_CSI_DriverPolicy"
      [32m+[0m[0m role       = "astro-data-pipeline-ebs-csi-driver-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_cluster_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_cluster_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = "astro-data-pipeline-staging-eks-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_cni_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_cni_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "astro-data-pipeline-staging-eks-nodes-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_container_registry_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_container_registry_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      [32m+[0m[0m role       = "astro-data-pipeline-staging-eks-nodes-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_s3_access[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_s3_access" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "astro-data-pipeline-staging-eks-nodes-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_vpc_resource_controller[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_vpc_resource_controller" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m[0m role       = "astro-data-pipeline-staging-eks-cluster-role"
    }

[1m  # aws_iam_role_policy_attachment.eks_worker_node_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "eks_worker_node_policy" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = "astro-data-pipeline-staging-eks-nodes-role"
    }

[1mPlan:[0m 19 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m eks_cloudwatch_log_group_name          = "/aws/eks/astro-data-pipeline-staging-eks/cluster"
  [32m+[0m[0m eks_cluster_arn                        = (known after apply)
  [32m+[0m[0m eks_cluster_certificate_authority_data = (known after apply)
  [32m+[0m[0m eks_cluster_endpoint                   = (known after apply)
  [32m+[0m[0m eks_cluster_id                         = (known after apply)
  [32m+[0m[0m eks_cluster_name                       = "astro-data-pipeline-staging-eks"
  [32m+[0m[0m eks_cluster_platform_version           = (known after apply)
  [32m+[0m[0m eks_cluster_role_arn                   = (known after apply)
  [32m+[0m[0m eks_cluster_status                     = (known after apply)
  [32m+[0m[0m eks_cluster_version                    = "1.28"
  [32m+[0m[0m eks_node_group_role_arn                = (known after apply)
  [32m+[0m[0m eks_node_groups                        = {
      [32m+[0m[0m general = {
          [32m+[0m[0m arn            = (known after apply)
          [32m+[0m[0m capacity_type  = "ON_DEMAND"
          [32m+[0m[0m instance_types = [
              [32m+[0m[0m "t3.medium",
            ]
          [32m+[0m[0m scaling_config = [
              [32m+[0m[0m {
                  [32m+[0m[0m desired_size = 1
                  [32m+[0m[0m max_size     = 3
                  [32m+[0m[0m min_size     = 1
                },
            ]
          [32m+[0m[0m status         = (known after apply)
        }
    }
  [32m+[0m[0m eks_oidc_issuer_url                    = (known after apply)
  [32m+[0m[0m eks_oidc_provider_arn                  = (known after apply)
  [32m+[0m[0m kubectl_config_command                 = "aws eks update-kubeconfig --region us-east-1 --name astro-data-pipeline-staging-eks"
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "s3_buckets" but a value
[33m│[0m [0mwas found in file "../staging.tfvars". If you meant to use this value, add
[33m│[0m [0ma "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named
[33m│[0m [0m"single_nat_gateway_for_prototyping" but a value was found in file
[33m│[0m [0m"../staging.tfvars". If you meant to use this value, add a "variable" block
[33m│[0m [0mto the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValues for undeclared variables[0m
[33m│[0m [0m
[33m│[0m [0m[0mIn addition to the other similar warnings shown, 25 other variable(s)
[33m│[0m [0mdefined without being declared.
[33m╵[0m[0m

```

</details>

*Pushed by: @p27mcgee, Action: `pull_request`*